---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkedFileStatus.Imported
enum: Autodesk.Revit.DB.LinkedFileStatus
source: html/410b48f8-2a32-3d54-492c-c9a9fe4030ca.htm
---
# Autodesk.Revit.DB.LinkedFileStatus.Imported

The element represented by this value was imported
 into Revit rather than linked into Revit.